{
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "dtype": "float32",
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "battery",
    "1": "biological",
    "2": "brown-glass",
    "3": "cardboard",
    "4": "clothes",
    "5": "e-waste",
    "6": "green-glass",
    "7": "metal",
    "8": "paper",
    "9": "plastic",
    "10": "shoes",
    "11": "trash",
    "12": "white-glass"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "battery": 0,
    "biological": 1,
    "brown-glass": 2,
    "cardboard": 3,
    "clothes": 4,
    "e-waste": 5,
    "green-glass": 6,
    "metal": 7,
    "paper": 8,
    "plastic": 9,
    "shoes": 10,
    "trash": 11,
    "white-glass": 12
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "pooler_act": "tanh",
  "pooler_output_size": 768,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "transformers_version": "4.57.3"
}
